---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ModelCurve
source: html/38cb5e43-3bed-c29a-25ce-8da74cabff1f.htm
---
# ModelCurve Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.